isToBeSkipped(AcDbAssocStatus)
Returns true iff the AcDbAssocStatus indicates that the action or dependency
should be skipped and treated as it it were not there.
status:  The AcDbAssocStatus.
Returns:
Returns true iff the AcDbAssocStatus indicates that the action or dependency
should be skipped and treated as it it were not there.